NathaanTFM/stm32cart/Core/Src/ndscart.c
#include "main.h"
#include "key1.h"
#include "config.h"
#include "blowfish_table.h"

#include <string.h>
#include <stdio.h>
#include <setjmp.h>

#include <stm32g4xx_hal.h>

// define this for WIP 1000h bytes transfer support
#define TRANSFER_1000H
#define ENABLE_SPI2

static jmp_buf jmp;
void *stackPointer;

#define CLK_Pin (1<<12)
#define UNUSED_Pin (1<<13)
#define CS1_Pin (1<<14)
#define CS2_Pin (1<<15)

// NEXT_DATA macro
#define NEXT_DATA() (*(data++))

#define ALIGN(n) __attribute__ ((aligned (n)))
#define NO_INIT __attribute__ ((section(".noinit")))

// transfer buffer backup
static volatile uint16_t currentState = 0;

#define DATA_SPI1 (*(volatile uint8_t *)&SPI1->DR)
#define DATA_OUT (*(volatile uint8_t *)&GPIOA->ODR)

// data input/output buffer
// first command is 2000h bytes long
#define TRANSFER_BUFFER_SIZE (0x2200)

// NDS      c0  c1  c2  c3  c4  c5  c6  c7  d0  d1
// 		     ↓   ↓   ↓   ↓   ↓   ↓   ↓   ↓   ↓   ↓
//    CLK ‾‾‾|_|‾|_|‾|_|‾|_|‾|_|‾|_|‾|_|‾|_|‾|_|‾|_|‾‾‾‾
//             ↑   ↑   ↑   ↑   ↑   ↑   ↑   ↑   ↑   ↑
// GPIO TX    b0  b1  b2  b3  b4  b5  b6  b7  b8  b9

#define COMMAND_TRANSFER_DELTA (0)
#define DATA_TRANSFER_DELTA (17) // we write at b7 for d0 (see above), so it's 8-7=1 to have our dword alignment

// transferBuffer:
// 0
// ...
// COMMAND_TRANSFER_DELTA
// ...
// COMMAND_TRANSFER_DELTA + 8
// ...
// DATA_TRANSFER_DELTA
// ...
// DATA_TRANSFER_DELTA+TRANSFER_BUFFER_SIZE

static ALIGN(4) NO_INIT volatile uint8_t transferBufferInternal[TRANSFER_BUFFER_SIZE + DATA_TRANSFER_DELTA + 8]; // Adding 8 bytes because data and command could overlap
static volatile uint8_t * const transferBuffer = transferBufferInternal + DATA_TRANSFER_DELTA - 1 + 8; // 4-bytes aligned (because key2 is aligned)
static volatile uint8_t * const command = transferBufferInternal + COMMAND_TRANSFER_DELTA; // 4-bytes aligned (because key2 is aligned)
#define COMMAND_HI *(volatile uint32_t*)(transferBufferInternal)
#define COMMAND_LO *(volatile uint32_t*)(transferBufferInternal+4)

// macros for transfers
//#define COMMAND_BUF_SIZE (8)
#define COMMAND_BUF_SIZE (sizeof(transferBufferInternal) - COMMAND_TRANSFER_DELTA)

#define WAIT_FOR_BYTE_NO_CS(idx) \
	while (DMA1_Channel1->CNDTR >= (COMMAND_BUF_SIZE - (idx)));

#define WAIT_FOR_BYTE(idx) \
	while (DMA1_Channel1->CNDTR >= (COMMAND_BUF_SIZE - (idx)));

#define COMMAND_PROGRESS() \
	(COMMAND_BUF_SIZE - DMA1_Channel1->CNDTR)

#define DATA_PROGRESS() \
	((int32_t)((COMMAND_BUF_SIZE - 8) - DMA1_Channel1->CNDTR))

#define SEED_BUFFER_SIZE (0x4000)
#define SEED_MASK (SEED_BUFFER_SIZE-1)
static volatile ALIGN(0x4) NO_INIT uint8_t seedBuffer[SEED_BUFFER_SIZE];
static volatile uint16_t seedPosition = 0; // next starting position
static volatile int16_t seedAvailable = 0; // available bytes

#define KEY2_BEGIN() do { uint16_t _spos = (seedPosition); ((void)0)
#define KEY2_AT(x) (*(volatile uint8_t*)(&seedBuffer[(_spos + x) & SEED_MASK]))
#define KEY2_AT_32(x) (*(volatile uint32_t*)(&seedBuffer[(_spos + x) & SEED_MASK]))
#define KEY2_END() } while (0)

// key2 encryption variables
static NO_INIT volatile uint16_t gpioModeBuffer[8];
static NO_INIT volatile uint32_t dmamuxGeneratorEnable[2];
static NO_INIT volatile uint32_t dmamuxGeneratorDisable[2];

static volatile int cs1Enabled = 0, cs2Enabled = 0;

static ALIGN(4) NO_INIT volatile uint8_t spiBuffer[0x40];

#define SPI_AVAILABLE(sz) (int32_t)(sz - DMA2_Channel2->CNDTR)
//#define IS_SPI_AVAILABLE(sz, nb) ((uint32_t)DMA2_Channel2->CNDTR < (uint32_t)(sz-nb))
#define IS_SPI_AVAILABLE(sz, nb) (SPI_AVAILABLE(sz) > nb)
#define SPI_WAIT(sz, nb) while (!IS_SPI_AVAILABLE(sz, nb)); // wait for index to be available

#ifdef ENABLE_SPI2
static volatile uint32_t spi2cr[2];
static volatile uint32_t gpiof_moder;
#endif

/* KEY 2 */
struct hilo {
    uint32_t hi;
    uint32_t lo;
};

struct key2 {
	struct hilo x;
	struct hilo y;
};

static volatile struct key2 key2;

static inline void setKey2Seed(volatile struct hilo *key2, uint32_t hi, uint32_t lo) {
	uint32_t tmp = __RBIT(lo);

    key2->hi = tmp >> 25;
    key2->lo = (tmp << 7) | (__RBIT(hi) >> 25);
}

static inline void initKey2Default(void) {
    setKey2Seed(&key2.x, 0x58, 0xC56DE0E8);
    setKey2Seed(&key2.y, 0x5C, 0x879B9B05);
}

static inline void initKey2(uint32_t value, uint32_t seed) {
	setKey2Seed(&key2.x, (value >> 17), (value << 15) | 0x6000 | seed);
    setKey2Seed(&key2.y, 0x5C, 0x879B9B05);
}


/* FAULT HANDLER */
void fault_handler(uint32_t magic) {
	__disable_irq();

	// Reset GPIOA (might allow us to reconnect)
	__HAL_RCC_GPIOA_FORCE_RESET();
	__NOP(); __NOP(); __NOP();
	__HAL_RCC_GPIOA_RELEASE_RESET();

	for (;;);
}

static void delay(uint32_t count) {
	volatile uint32_t x = count;
	while (x > 0)
		--x;
}

static void memcpy_v(volatile void *dest, volatile const void *src, size_t n) {
    volatile const char *src_c = src;
    volatile char *dest_c = dest;
    for (size_t i = 0; i < n; i++)
        dest_c[i] = src_c[i];
}

static inline void spiSelect() {
	GPIOB->BRR = (1<<6); // reset pin, drive it low
}

static inline void spiUnselect() {
	GPIOB->BSRR = (1<<6); // set pin, drive it high
}

static inline void spiStop() {
	// Disable SPI DMA
	DMA2_Channel1->CCR &= ~(DMA_CCR_EN | DMA_CCR_CIRC);
	DMA2_Channel2->CCR &= ~DMA_CCR_EN;

	if (SPI1->CR1 & SPI_CR1_SPE) {
		// Disable SPI DMA Request
		SPI1->CR2 &= ~(SPI_CR2_TXDMAEN | SPI_CR2_RXDMAEN);

		// Wait for FTLVL=0 and BSY=0
		while (SPI1->SR & (SPI_SR_FTLVL | SPI_SR_BSY));

		SPI1->CR1 &= ~SPI_CR1_SPE;

		// Wait for FRLVL=0
		while (SPI1->SR & SPI_SR_FRLVL) {
			volatile uint8_t tmpreg8 = *(__IO uint8_t *)&SPI1->DR;
			UNUSED(tmpreg8);
		}
	}

	spiUnselect();
}

static inline void spiPrepareEnable() {
	// Disable SPI DMA
	DMA2_Channel1->CCR &= ~(DMA_CCR_EN | DMA_CCR_CIRC);
	DMA2_Channel2->CCR &= ~DMA_CCR_EN;

	// Enable SPI
	SPI1->CR1 |= SPI_CR1_SPE;
	SPI1->CR2 |= (SPI_CR2_TXDMAEN | SPI_CR2_RXDMAEN);
}

static inline void spiInit() {
	SPI1->CR1 = (
		  (0 << SPI_CR1_BIDIMODE_Pos) // 2-line unidirectional data mode
		| (0 << SPI_CR1_CRCEN_Pos) // crc calculation disabled
		| (0 << SPI_CR1_RXONLY_Pos) // full-duplex
		| (1 << SPI_CR1_SSM_Pos) // software slave management enabled
		| (1 << SPI_CR1_SSI_Pos) // internal slave select enabled
		| (0 << SPI_CR1_LSBFIRST_Pos) // msb first
		| (0 << SPI_CR1_SPE_Pos) // peripheral disabled
		| (0 << SPI_CR1_BR_Pos) // fpclk/2
		| (1 << SPI_CR1_MSTR_Pos) // master configuration
		| (0 << SPI_CR1_CPOL_Pos) // clock to 0 when idle
		| (0 << SPI_CR1_CPHA_Pos) // first clock transition is data capture edge
	);

	SPI1->CR2 = (
		  (0 << SPI_CR2_LDMATX_Pos) // not an odd number
		| (0 << SPI_CR2_LDMARX_Pos) // not an odd number
		| (1 << SPI_CR2_FRXTH_Pos) // 8-bit event
		| (7 << SPI_CR2_DS_Pos) // 8-bit data size
		| (0 << SPI_CR2_TXEIE_Pos) // TXE interrupt masked
		| (0 << SPI_CR2_RXNEIE_Pos) // RXNE interrupt masked
		| (0 << SPI_CR2_ERRIE_Pos) // error interrupt maked
		| (0 << SPI_CR2_FRF_Pos) // SPI Motorola mode
		| (0 << SPI_CR2_NSSP_Pos) // no nss pulse
		| (0 << SPI_CR2_SSOE_Pos) // SS output disable
		| (0 << SPI_CR2_TXDMAEN_Pos) // Tx buffer DMA disabled
		| (0 << SPI_CR2_RXDMAEN_Pos) // Rx buffer DMA disabled
	);
}

