NathaanTFM/stm32cart/Core/Src/ndscart.c
static inline void spiInitDma() {
	// Initialize DMA for SPI
	DMA2_Channel1->CPAR = (uint32_t)&SPI1->DR;
	DMA2_Channel1->CMAR = (uint32_t)spiBuffer;
	DMA2_Channel1->CCR = (
		  (0 << DMA_CCR_MEM2MEM_Pos) // disable memory-to-memory
		| (2 << DMA_CCR_PL_Pos) // high priority
		| (0 << DMA_CCR_MSIZE_Pos) // 8 bits in memory
		| (0 << DMA_CCR_PSIZE_Pos) // 8 bits in peripheral (SPI1)
		| (1 << DMA_CCR_MINC_Pos) // increment memory
		| (0 << DMA_CCR_PINC_Pos) // do not increment peripheral
		| (0 << DMA_CCR_CIRC_Pos) // circular mode!
		| (1 << DMA_CCR_DIR_Pos) // read from memory
		| (0 << DMA_CCR_TEIE_Pos) // disable transfer error interrupt
		| (0 << DMA_CCR_HTIE_Pos) // disable half transfer interrupt
		| (0 << DMA_CCR_TCIE_Pos) // disable transfer complete interrupt
		| (0 << DMA_CCR_EN_Pos) // do not enable channel yet
	);

	DMAMUX1_Channel6->CCR = (
		(11 << DMAMUX_CxCR_DMAREQ_ID_Pos) // SPI1 TX
	);

	DMA2_Channel2->CPAR = (uint32_t)&SPI1->DR;
	DMA2_Channel2->CMAR = (uint32_t)spiBuffer;
	DMA2_Channel2->CCR = (
		  (0 << DMA_CCR_MEM2MEM_Pos) // disable memory-to-memory
		| (2 << DMA_CCR_PL_Pos) // high priority
		| (0 << DMA_CCR_MSIZE_Pos) // 8 bits in memory
		| (0 << DMA_CCR_PSIZE_Pos) // 8 bits in peripheral (SPI1)
		| (1 << DMA_CCR_MINC_Pos) // increment memory
		| (0 << DMA_CCR_PINC_Pos) // do not increment peripheral
		| (0 << DMA_CCR_CIRC_Pos) // no circular mode
		| (0 << DMA_CCR_DIR_Pos) // read from peripheral
		| (0 << DMA_CCR_TEIE_Pos) // disable transfer error interrupt
		| (0 << DMA_CCR_HTIE_Pos) // disable half transfer interrupt
		| (0 << DMA_CCR_TCIE_Pos) // disable transfer complete interrupt
		| (0 << DMA_CCR_EN_Pos) // do not enable channel yet
	);

	DMAMUX1_Channel7->CCR = (
		(10 << DMAMUX_CxCR_DMAREQ_ID_Pos) // SPI1 RX
	);
}

static inline void spiAbort() {
	spiUnselect();

	// Disable SPI DMA
	DMA2_Channel1->CCR &= ~(DMA_CCR_EN | DMA_CCR_CIRC);
	DMA2_Channel2->CCR &= ~DMA_CCR_EN;

	// Reset SPI
	__HAL_RCC_SPI1_FORCE_RESET();
	__HAL_RCC_SPI1_RELEASE_RESET();

	// Re-init SPI
	spiInit();

	// We need to enable it now (spiPrepareEnable)
	SPI1->CR1 |= SPI_CR1_SPE;
	SPI1->CR2 |= (SPI_CR2_TXDMAEN | SPI_CR2_RXDMAEN);
}

// high-level for spi commands
static void spiCommand(uint8_t *txbuf, uint16_t txlen, uint8_t *rxbuf, uint16_t rxlen) {
	// enable spi
	spiSelect();

	SPI1->CR1 |= SPI_CR1_SPE;

	// write txlen bytes from txbuf
	while (txlen) {
		while (!(SPI1->SR & SPI_SR_TXE));
		*(__IO uint8_t *)&SPI1->DR = *(txbuf++);

		while (!(SPI1->SR & SPI_SR_RXNE));
		volatile uint8_t x = *(__IO uint8_t *)&SPI1->DR;
		UNUSED(x);

		txlen--;
	}

	// read rxlen bytes into rxbuf
	while (rxlen) {
		while (!(SPI1->SR & SPI_SR_TXE));
		*(__IO uint8_t *)&SPI1->DR = 0; // dummy write

		while (!(SPI1->SR & SPI_SR_RXNE));
		*(rxbuf++) = *(__IO uint8_t *)&SPI1->DR;

		rxlen--;
	}

	spiStop();
}

static inline void spiCommandDMA(volatile uint8_t *txbuf, volatile uint8_t *rxbuf, uint16_t len) {
	spiSelect();

	// set addresses of DMA channels
	DMA2_Channel1->CMAR = (uint32_t)txbuf;
	DMA2_Channel2->CMAR = (uint32_t)rxbuf;

	// set lengths of dma channels
	DMA2_Channel1->CNDTR = len;
	DMA2_Channel2->CNDTR = len;

	// enable dma channels
	DMA2_Channel1->CCR |= DMA_CCR_EN;
	DMA2_Channel2->CCR |= DMA_CCR_EN;

	// enable spi
	SPI1->CR1 |= SPI_CR1_SPE;

	// enable events
	SPI1->CR2 |= (SPI_CR2_TXDMAEN | SPI_CR2_RXDMAEN);
	//SPI1->CR2 |= SPI_CR2_RXDMAEN;

	while (DMA2_Channel2->CNDTR != 0);
	spiStop();
}

static inline volatile uint8_t * spiDataRead(uint32_t address, uint16_t size, volatile uint8_t *dst) {
	// This borrows the transferBuffer!
	spiSelect();

	// set address of dma channel
	DMA2_Channel1->CMAR = (uint32_t)spiBuffer;
	DMA2_Channel2->CMAR = (uint32_t)dst;

	spiBuffer[0] = 0x0B; // read data
	spiBuffer[1] = 0; // dummy byte
	spiBuffer[2] = address >> 16; // 24-bit address
	spiBuffer[3] = address >> 8; // 24-bit address
	spiBuffer[4] = address >> 0; // 24-bit address

	// set lengths of dma channels
	DMA2_Channel1->CNDTR = 4+size;
	DMA2_Channel2->CNDTR = 4+size;

	// enable spi
	SPI1->CR1 |= SPI_CR1_SPE;
	//SPI1->CR2 |= SPI_CR2_RXDMAEN;

	// enable events
	SPI1->CR2 |= (SPI_CR2_TXDMAEN | SPI_CR2_RXDMAEN);

	// enable dma channels
	DMA2_Channel1->CCR |= DMA_CCR_EN;
	DMA2_Channel2->CCR |= DMA_CCR_EN;

	//while (DMA2_Channel2->CNDTR >= 0x203);

	// N.B: make sure it's aligned (change spiBuffer in DMA2_Channel2->CMAR if it's not)
	// UPDATE: it might not be and we have no control over it - this method is used for general cases
	return &dst[5];
}

static void spiWriteEnable() {
	uint8_t cmd[1] = {0x06};
	spiCommand(cmd, 1, NULL, 0);
}

static void spiWriteDisable() {
	uint8_t cmd[1] = {0x04};
	spiCommand(cmd, 1, NULL, 0);
}

static uint8_t spiReadStatus() {
	uint8_t cmd[1] = {0x05};
	uint8_t byte[1];
	spiCommand(cmd, 1, byte, 1);
	return byte[0];
}

static void spiProgramPage(uint32_t address, volatile uint8_t *data) {
	while (spiReadStatus() & 1) delay(5000);
	spiWriteEnable();

	// useless memcpy, need to work on spiCommand
	// i'll let it here for now
	static NO_INIT volatile uint8_t cmd[0x104];
	memcpy_v(cmd, (volatile uint8_t[]){0x02, address >> 16, address >> 8, address >> 0}, 4);
	memcpy_v(cmd+4, data, 0x100);
	spiCommandDMA(cmd, cmd, 0x104);

	while (spiReadStatus() & 1) delay(5000);
	spiWriteDisable();
}

static void spiEraseSector(uint32_t address) {
	while (spiReadStatus() & 1) delay(5000);
	spiWriteEnable();

	uint8_t cmd[4] = {0x20, address >> 16, address >> 8, address >> 0};
	spiCommand(cmd, 4, NULL, 0);

	while (spiReadStatus() & 1) delay(5000);
	spiWriteDisable();
}

static void spiEraseChip() {
	while (spiReadStatus() & 1) delay(5000);
	spiWriteEnable();

	uint8_t cmd[1] = {0xC7};
	spiCommand(cmd, 1, NULL, 0);

	while (spiReadStatus() & 1) delay(5000);
	spiWriteDisable();
}

#ifdef ENABLE_SPI2

static inline void spi2Init() {
	// Initialize SPI2
	SPI2->CR1 = (
		(0 << SPI_CR1_BIDIMODE_Pos) /* 2-line unidirectional data mode*/
		| (0 << SPI_CR1_CRCEN_Pos) /* crc calculation disabled*/
		| (0 << SPI_CR1_RXONLY_Pos) /* full-duplex */
		| (1 << SPI_CR1_SSM_Pos) /* software slave management enabled */
		| (0 << SPI_CR1_SSI_Pos) /* internal slave select enabled*/
		| (0 << SPI_CR1_LSBFIRST_Pos) /* msb first*/
		| (0 << SPI_CR1_SPE_Pos) /* peripheral disabled*/
		| (0 << SPI_CR1_BR_Pos) /* fpclk/2*/
		| (0 << SPI_CR1_MSTR_Pos) /* slave configuration*/
		| (1 << SPI_CR1_CPOL_Pos) /* clock to 0 when idle*/
		| (1 << SPI_CR1_CPHA_Pos) /* first clock transition is data capture edge*/
	);

	SPI2->CR2 = (
		  (0 << SPI_CR2_LDMATX_Pos) // not an odd number
		| (0 << SPI_CR2_LDMARX_Pos) // not an odd number
		| (1 << SPI_CR2_FRXTH_Pos) // 8-bit event
		| (7 << SPI_CR2_DS_Pos) // 8-bit data size
		| (0 << SPI_CR2_TXEIE_Pos) // TXE interrupt masked
		| (0 << SPI_CR2_RXNEIE_Pos) // RXNE interrupt masked
		| (0 << SPI_CR2_ERRIE_Pos) // error interrupt maked
		| (0 << SPI_CR2_FRF_Pos) // SPI Motorola mode
		| (0 << SPI_CR2_NSSP_Pos) // no nss pulse
		| (0 << SPI_CR2_SSOE_Pos) // SS output disable
		| (0 << SPI_CR2_TXDMAEN_Pos) // Tx buffer DMA enabled
		| (0 << SPI_CR2_RXDMAEN_Pos) // Rx buffer DMA enabled
	);

	spi2cr[0] = SPI2->CR1 | SPI_CR1_SPE;
	spi2cr[1] = SPI2->CR2;
}

static inline void spi2Reset() {
	__HAL_RCC_SPI2_FORCE_RESET();
	__HAL_RCC_SPI2_RELEASE_RESET();

	spi2Init();
}

#endif


