NathaanTFM/stm32cart/Core/Src/ndscart.c
static inline void dmamuxInit() {
	// request generator 0: low clk
	DMAMUX1_RequestGenerator0->RGCR = (
		  (0  << DMAMUX_RGxCR_GNBREQ_Pos) // GNBREQ-1
		| (2  << DMAMUX_RGxCR_GPOL_Pos) // falling edge
		| (0  << DMAMUX_RGxCR_GE_Pos) // do not enable generator yet
		| (0  << DMAMUX_RGxCR_OIE_Pos) // disable overrun event
		| (12 << DMAMUX_RGxCR_SIG_ID_Pos) // EXTI12 (CLK)
	);

	// request generator 1: high clk
	DMAMUX1_RequestGenerator1->RGCR = (
		  (0  << DMAMUX_RGxCR_GNBREQ_Pos) // GNBREQ-1
		| (1  << DMAMUX_RGxCR_GPOL_Pos) // rising edge
		| (0  << DMAMUX_RGxCR_GE_Pos) // do not enable generator yet
		| (0  << DMAMUX_RGxCR_OIE_Pos) // disable overrun event
		| (12 << DMAMUX_RGxCR_SIG_ID_Pos) // EXTI12 (CLK)
	);

	// request generator 2: low cs1, 2 transfers
	DMAMUX1_RequestGenerator2->RGCR = (
		  (1  << DMAMUX_RGxCR_GNBREQ_Pos) // GNBREQ-1 (generate 2 transfers)
		| (2  << DMAMUX_RGxCR_GPOL_Pos) // falling edge
		| (1  << DMAMUX_RGxCR_GE_Pos) // enable generator
		| (0  << DMAMUX_RGxCR_OIE_Pos) // disable overrun event
		| (14 << DMAMUX_RGxCR_SIG_ID_Pos) // EXTI14 (CS1)
	);

#ifdef ENABLE_SPI2
	if (config.spi_variant != 0) {
		// request generator 3: low cs2
		DMAMUX1_RequestGenerator3->RGCR = (
			  (1  << DMAMUX_RGxCR_GNBREQ_Pos) // GNBREQ-1 (generate 2 transfers)
			| (2  << DMAMUX_RGxCR_GPOL_Pos) // falling edge
			| (1  << DMAMUX_RGxCR_GE_Pos) // enable generator
			| (0  << DMAMUX_RGxCR_OIE_Pos) // disable overrun event
			| (15 << DMAMUX_RGxCR_SIG_ID_Pos) // EXTI15 (CS2)
		);
	} else {
#endif
		// request generator 3: high cs1, 2 transfers
		DMAMUX1_RequestGenerator3->RGCR = (
			  (1  << DMAMUX_RGxCR_GNBREQ_Pos) // GNBREQ-1 (generate 2 transfers)
			| (1  << DMAMUX_RGxCR_GPOL_Pos) // rising edge
			| (0  << DMAMUX_RGxCR_GE_Pos) // enable generator
			| (0  << DMAMUX_RGxCR_OIE_Pos) // disable overrun event
			| (14 << DMAMUX_RGxCR_SIG_ID_Pos) // EXTI14 (CS1)
		);
#ifdef ENABLE_SPI2
	}
#endif

	// Fill the dmamuxGeneratorEnable buffer
	dmamuxGeneratorEnable[0] = DMAMUX1_RequestGenerator0->RGCR | DMAMUX_RGxCR_GE;
	dmamuxGeneratorEnable[1] = DMAMUX1_RequestGenerator1->RGCR | DMAMUX_RGxCR_GE;
	dmamuxGeneratorDisable[0] = DMAMUX1_RequestGenerator0->RGCR & ~DMAMUX_RGxCR_GE;
	dmamuxGeneratorDisable[1] = DMAMUX1_RequestGenerator1->RGCR & ~DMAMUX_RGxCR_GE;
}

static inline void dmamuxClearFlags() {
	DMAMUX1_RequestGenStatus->RGCFR = DMAMUX1_RequestGenStatus->RGSR;
	DMAMUX1_ChannelStatus->CFR = DMAMUX1_ChannelStatus->CSR;
}

static inline void dmaInit() {
	// Command transfer
	DMA1_Channel1->CCR = (
		  (0 << DMA_CCR_MEM2MEM_Pos) // disable memory-to-memory
		| (2 << DMA_CCR_PL_Pos) // high priority
		| (0 << DMA_CCR_MSIZE_Pos) // 8 bits in memory
		| (0 << DMA_CCR_PSIZE_Pos) // 8 bits in peripheral (GPIO)
		| (1 << DMA_CCR_MINC_Pos) // increment memory
		| (0 << DMA_CCR_PINC_Pos) // do not increment peripheral
		| (0 << DMA_CCR_CIRC_Pos) // no circular mode
		| (0 << DMA_CCR_DIR_Pos) // read from peripheral
		| (0 << DMA_CCR_TEIE_Pos) // disable transfer error interrupt
		| (0 << DMA_CCR_HTIE_Pos) // disable half transfer interrupt
		| (0 << DMA_CCR_TCIE_Pos) // disable transfer complete interrupt
		| (0 << DMA_CCR_EN_Pos) // do not enable channel yet
	);

	DMAMUX1_Channel0->CCR = (
		(1 << DMAMUX_CxCR_DMAREQ_ID_Pos) // Request Generator 0
	);

	DMA1_Channel1->CPAR = (uint32_t)&GPIOA->IDR;
	DMA1_Channel1->CMAR = (uint32_t)transferBufferInternal+COMMAND_TRANSFER_DELTA;

	// Data transfer
	DMA1_Channel2->CCR = (
		  (0 << DMA_CCR_MEM2MEM_Pos) // disable memory-to-memory
		| (3 << DMA_CCR_PL_Pos) // *very* high priority
		| (0 << DMA_CCR_MSIZE_Pos) // 8 bits in memory
		| (0 << DMA_CCR_PSIZE_Pos) // 8 bits in peripheral (GPIO)
		| (1 << DMA_CCR_MINC_Pos) // increment memory
		| (0 << DMA_CCR_PINC_Pos) // do not increment peripheral
		| (0 << DMA_CCR_CIRC_Pos) // no circular mode
		| (1 << DMA_CCR_DIR_Pos) // read from memory
		| (0 << DMA_CCR_TEIE_Pos) // disable transfer error interrupt
		| (0 << DMA_CCR_HTIE_Pos) // disable half transfer interrupt
		| (0 << DMA_CCR_TCIE_Pos) // disable transfer complete interrupt
		| (0 << DMA_CCR_EN_Pos) // do not enable channel yet
	);

	DMAMUX1_Channel1->CCR = (
		(2 << DMAMUX_CxCR_DMAREQ_ID_Pos) // Request Generator 1
	);

	DMA1_Channel2->CPAR = (uint32_t)&GPIOA->ODR;
	DMA1_Channel2->CMAR = (uint32_t)transferBufferInternal+DATA_TRANSFER_DELTA;

	// GPIO mode transfer
	// This sets GPIO as output after 7 transfers
	DMA1_Channel3->CCR = (
		  (0 << DMA_CCR_MEM2MEM_Pos) // disable memory-to-memory
		| (2 << DMA_CCR_PL_Pos) // high priority
		| (1 << DMA_CCR_MSIZE_Pos) // 16 bits in memory
		| (1 << DMA_CCR_PSIZE_Pos) // 16 bits in peripheral (GPIO MODER)
		| (1 << DMA_CCR_MINC_Pos) // increment memory
		| (0 << DMA_CCR_PINC_Pos) // do not increment peripheral
		| (0 << DMA_CCR_CIRC_Pos) // no circular mode
		| (1 << DMA_CCR_DIR_Pos) // read from memory
		| (0 << DMA_CCR_TEIE_Pos) // disable transfer error interrupt
		| (0 << DMA_CCR_HTIE_Pos) // disable half transfer interrupt
		| (0 << DMA_CCR_TCIE_Pos) // disable transfer complete interrupt
		| (0 << DMA_CCR_EN_Pos) // do not enable channel yet
	);

	DMAMUX1_Channel2->CCR = (
		(2 << DMAMUX_CxCR_DMAREQ_ID_Pos) // Request Generator 1
	);

	DMA1_Channel3->CPAR = (uint32_t)&GPIOA->MODER;
	DMA1_Channel3->CMAR = (uint32_t)gpioModeBuffer;

	// CS transfer
	DMA1_Channel4->CCR = (
		  (0 << DMA_CCR_MEM2MEM_Pos) // disable memory-to-memory
		| (1 << DMA_CCR_PL_Pos) // normal priority
		| (2 << DMA_CCR_MSIZE_Pos) // 32 bits in memory
		| (2 << DMA_CCR_PSIZE_Pos) // 32 bits in peripheral (DMA)
		| (1 << DMA_CCR_MINC_Pos) // increment memory
		| (1 << DMA_CCR_PINC_Pos) // increment peripheral
		| (1 << DMA_CCR_CIRC_Pos) // circular mode
		| (1 << DMA_CCR_DIR_Pos) // read from memory
		| (0 << DMA_CCR_TEIE_Pos) // disable transfer error interrupt
		| (0 << DMA_CCR_HTIE_Pos) // disable half transfer interrupt
		| (0 << DMA_CCR_TCIE_Pos) // disable transfer complete interrupt
		| (0 << DMA_CCR_EN_Pos) // do not enable channel yet
	);

	DMAMUX1_Channel3->CCR = (
		(3 << DMAMUX_CxCR_DMAREQ_ID_Pos) // Request Generator 2
	);

