NathaanTFM/stm32cart/Core/Src/ndscart.c
	DMA1_Channel4->CPAR = (uint32_t)&DMAMUX1_RequestGenerator0->RGCR;
	DMA1_Channel4->CMAR = (uint32_t)dmamuxGeneratorEnable;
	DMA1_Channel4->CNDTR = sizeof(dmamuxGeneratorEnable) / sizeof(uint32_t);

#ifdef ENABLE_SPI2
	if (config.spi_variant != 0) {
		// CS transfer (CS2 variant)
		// The point here is to start the SPI channel transfer as soon as chip is selected
		DMA1_Channel5->CCR = (
			  (0 << DMA_CCR_MEM2MEM_Pos) // disable memory-to-memory
			| (1 << DMA_CCR_PL_Pos) // normal priority
			| (2 << DMA_CCR_MSIZE_Pos) // 32 bits in memory
			| (2 << DMA_CCR_PSIZE_Pos) // 32 bits in peripheral (DMA)
			| (1 << DMA_CCR_MINC_Pos) // increment memory
			| (1 << DMA_CCR_PINC_Pos) // increment peripheral
			| (1 << DMA_CCR_CIRC_Pos) // circular mode
			| (1 << DMA_CCR_DIR_Pos) // read from memory
			| (0 << DMA_CCR_TEIE_Pos) // disable transfer error interrupt
			| (0 << DMA_CCR_HTIE_Pos) // disable half transfer interrupt
			| (0 << DMA_CCR_TCIE_Pos) // disable transfer complete interrupt
			| (0 << DMA_CCR_EN_Pos) // do not enable channel yet
		);

		DMAMUX1_Channel4->CCR = (
			(4 << DMAMUX_CxCR_DMAREQ_ID_Pos) // Request Generator 3
		);

		DMA1_Channel5->CPAR = (uint32_t)&SPI2->CR1;
		DMA1_Channel5->CMAR = (uint32_t)spi2cr;
		DMA1_Channel5->CNDTR = sizeof(spi2cr) / sizeof(uint32_t);

	} else {
#endif
		// CS transfer for disabling
		DMA1_Channel5->CCR = (
			  (0 << DMA_CCR_MEM2MEM_Pos) // disable memory-to-memory
			| (1 << DMA_CCR_PL_Pos) // normal priority
			| (2 << DMA_CCR_MSIZE_Pos) // 32 bits in memory
			| (2 << DMA_CCR_PSIZE_Pos) // 32 bits in peripheral (DMA)
			| (1 << DMA_CCR_MINC_Pos) // increment memory
			| (1 << DMA_CCR_PINC_Pos) // increment peripheral
			| (1 << DMA_CCR_CIRC_Pos) // circular mode
			| (1 << DMA_CCR_DIR_Pos) // read from peripheral
			| (0 << DMA_CCR_TEIE_Pos) // disable transfer error interrupt
			| (0 << DMA_CCR_HTIE_Pos) // disable half transfer interrupt
			| (0 << DMA_CCR_TCIE_Pos) // disable transfer complete interrupt
			| (0 << DMA_CCR_EN_Pos) // do not enable channel yet
		);

		DMAMUX1_Channel4->CCR = (
			(4 << DMAMUX_CxCR_DMAREQ_ID_Pos) // Request Generator 3
		);

		DMA1_Channel5->CPAR = (uint32_t)&DMAMUX1_RequestGenerator0->RGCR;
		DMA1_Channel5->CMAR = (uint32_t)dmamuxGeneratorDisable;
		DMA1_Channel5->CNDTR = sizeof(dmamuxGeneratorDisable) / sizeof(uint32_t);

#ifdef ENABLE_SPI2
	}
#endif
}

// we can abuse DMA to do this and reduce time. We need to find more dma abuse optimizations
static void dmaRestart() {
	// Disable all DMA channels
	DMA1_Channel1->CCR &= ~DMA_CCR_EN;
	DMA1_Channel2->CCR &= ~DMA_CCR_EN;
	DMA1_Channel3->CCR &= ~DMA_CCR_EN;

	// Disable generators
	DMAMUX1_RequestGenerator0->RGCR &= ~DMAMUX_RGxCR_GE;
	DMAMUX1_RequestGenerator1->RGCR &= ~DMAMUX_RGxCR_GE;
	//DMAMUX1_RequestGenerator2->RGCR &= ~DMAMUX_RGxCR_GE;

	// Re-configure dma channels
	DMA1_Channel1->CNDTR = COMMAND_BUF_SIZE; // read everything
	DMA1_Channel2->CNDTR = sizeof(transferBufferInternal)-DATA_TRANSFER_DELTA;
	DMA1_Channel3->CNDTR = sizeof(gpioModeBuffer) / 2;

	// Re-enable all DMA channels
	DMA1_Channel1->CCR |= DMA_CCR_EN;
	DMA1_Channel2->CCR |= DMA_CCR_EN;
	DMA1_Channel3->CCR |= DMA_CCR_EN;
}


static inline int16_t key2_step_4(int16_t savail, uint16_t spos) {
	uint32_t x_lo = key2.x.lo, x_hi = key2.x.hi;
    uint32_t x_tmp = (x_lo << 19) ^ (x_lo << 7) ^ (x_lo << 6) ^ ((x_lo >> 7) | (x_hi << 25));
    x_tmp ^= (x_tmp >> 13) ^ (x_tmp >> 25);

	uint32_t y_lo = key2.y.lo, y_hi = key2.y.hi;
    uint32_t y_tmp = (y_lo << 19) ^ (y_lo << 6) ^ (y_lo << 1) ^ ((y_lo >> 7) | (y_hi << 25));
    y_tmp ^= (y_tmp >> 13) ^ (y_tmp >> 31);

    __disable_irq();
    key2.x.hi = x_lo;
    key2.x.lo = x_tmp;
    key2.y.hi = y_lo;
    key2.y.lo = y_tmp;
    (*(volatile uint32_t *)(&seedBuffer[(spos+savail)&SEED_MASK])) = __builtin_bswap32(x_tmp ^ y_tmp);
    savail += 4;
    seedAvailable = savail;
    __enable_irq();
    return savail;
}

// TODO: try to remove the unrolling (it makes things slower, doesn't it?)
static inline int16_t key2_step(int16_t savail, uint16_t spos) {
//#pragma GCC unroll 16/4
	for (int i = 4; i != 0; --i) {
		savail = key2_step_4(savail, spos); //(volatile uint32_t *)(&seedBuffer[(spos+savail+i)&SEED_MASK]));
	}

	return savail;
}

static inline void key2_loop() {
	int16_t savail = seedAvailable;
	uint16_t spos = seedPosition;

	while (savail < 0x3FE0) {
		savail = key2_step(savail, spos);
	}
}

// TODO: test it
// could be faster, could be slower, who knows
static inline void key2_loop_test() {
    uint32_t x_lo = key2.x.lo, x_hi = key2.x.hi;
    uint32_t y_lo = key2.y.lo, y_hi = key2.y.hi;
    uint32_t x_tmp, y_tmp;
    
    uint32_t spos = seedPosition;
    uint32_t savail = seedAvailable;

    while (savail < 0x3FE0) {
        x_tmp = (x_lo << 19) ^ (x_lo << 7) ^ (x_lo << 6) ^ ((x_lo >> 7) | (x_hi << 25));
        x_tmp ^= (x_tmp >> 13) ^ (x_tmp >> 25);

        y_tmp = (y_lo << 19) ^ (y_lo << 6) ^ (y_lo << 1) ^ ((y_lo >> 7) | (y_hi << 25));
        y_tmp ^= (y_tmp >> 13) ^ (y_tmp >> 31);

        x_lo = (x_tmp << 19) ^ (x_tmp << 7) ^ (x_tmp << 6) ^ ((x_tmp >> 7) | (x_lo << 25));
        x_lo ^= (x_lo >> 13) ^ (x_lo >> 25);

        y_lo = (y_tmp << 19) ^ (y_tmp << 6) ^ (y_tmp << 1) ^ ((y_tmp >> 7) | (y_lo << 25));
        y_lo ^= (y_lo >> 13) ^ (y_lo >> 31);

        __disable_irq();
        key2.x.hi = x_tmp;
        key2.x.lo = x_lo;
        key2.y.hi = y_tmp;
        key2.y.lo = y_lo;
        (*(volatile uint32_t *)(&seedBuffer[(spos+savail)&SEED_MASK])) = __builtin_bswap32(x_tmp ^ y_tmp);
        (*(volatile uint32_t *)(&seedBuffer[(spos+savail+4)&SEED_MASK])) = __builtin_bswap32(x_lo ^ y_lo);
        savail += 8;
        seedAvailable = savail;
        __enable_irq();
    }
}

// this one ends if we reached the end of the buffer
#define CALCULATE_KEY2_WHILE(cond) \
	do { \
		int16_t savail = seedAvailable; \
		uint16_t spos = seedPosition; \
		if (savail < 0x3FE0) { \
			do { \
				savail = key2_step(savail, spos); \
			} while ((cond) && savail < 0x3FE0); \
		} \
	} while (0)

// this one ends when cond is false
#define DUMMY_KEY2_WHILE(cond) \
	do { \
		CALCULATE_KEY2_WHILE(cond); \
		while (cond); \
	} while (0)

static inline void initialize_key2(uint32_t seed) {
	initKey2(seed, 0xE8);

	// okay, we have calculated this mess, reset the positions
	seedPosition = 0;
	seedAvailable = 0;
}

// pre-init functions
static void preinit_command() {
	spiAbort();

	spiSelect();
	spiBuffer[3] = 0; // fourth command byte (a7-0)

	// set dma buf length
	DMA2_Channel1->CNDTR = 4; // command size (circular buffer) - first byte manual
	DMA2_Channel2->CNDTR = 0x1005;

	// set dma addresses
	DMA2_Channel1->CMAR = (uint32_t)spiBuffer+1; // txbuf
	DMA2_Channel2->CMAR = (uint32_t)transferBuffer-5; // rxbuf

	// enable RX dma channel (but disable TX dma channel)
	DMA2_Channel1->CCR &= ~DMA_CCR_EN;
	DMA2_Channel2->CCR |= DMA_CCR_EN;

	// write the first command byte
	*(__IO uint8_t *)&SPI1->DR = 0x0B;
}

static void preinit_key1() {
	spiAbort();

	spiSelect();
	spiBuffer[3] = 0; // fourth command byte (a7-0)

	// set dma buf length
	DMA2_Channel1->CNDTR = 4; // command size (circular buffer) - first byte manual
	DMA2_Channel2->CNDTR = 0x1005;

	// set dma addresses
	DMA2_Channel1->CMAR = (uint32_t)spiBuffer+1; // txbuf
	DMA2_Channel2->CMAR = (uint32_t)transferBuffer+0x19B8-0x1000-5; // rxbuf - strategic choice

	// enable RX dma channel (but disable TX dma channel)
	DMA2_Channel1->CCR &= ~DMA_CCR_EN;
	DMA2_Channel2->CCR |= DMA_CCR_EN;

	// write the first command byte
	*(__IO uint8_t *)&SPI1->DR = 0x0B;

