NathaanTFM/stm32cart/Core/Src/ndscart.c
}

static void preinit_key2() {
	spiAbort();

	spiSelect();
	spiBuffer[3] = 0; // fourth command byte (a7-0)

	// set dma buf length
#ifdef TRANSFER_1000H
	DMA2_Channel1->CNDTR = 5; // tx - the first command byte is written manually (command size)
	DMA2_Channel2->CNDTR = 0x1005;
#else
	DMA2_Channel1->CNDTR = 5; // tx - the first command byte is written manually (command size)
	DMA2_Channel2->CNDTR = 0x205;
#endif

	// set dma addresses
	DMA2_Channel1->CMAR = (uint32_t)spiBuffer+1; // txbuf
	DMA2_Channel2->CMAR = (uint32_t)transferBuffer-5; // rxbuf

	// enable RX dma channel (but disable TX dma channel)
	DMA2_Channel2->CCR |= DMA_CCR_EN;

	// write the first command byte
	*(__IO uint8_t*)&SPI1->DR = 0x0B;
}

static inline void spiDataRead_command(uint32_t address) {
	// specialized for normal mode (search for preinit_command)
	// write address
	*(volatile uint32_t *)&spiBuffer[0] = __builtin_bswap32(address);

	// enable tx dma channel
	DMA2_Channel1->CCR |= DMA_CCR_EN | DMA_CCR_CIRC;
}

static inline void spiDataRead_key1(uint32_t address) {
	spiSelect();
	*(volatile uint32_t *)&spiBuffer[0] = __builtin_bswap32(address);

	// enable tx dma channels
	DMA2_Channel1->CCR |= DMA_CCR_EN | DMA_CCR_CIRC;

	// nb: it's aligned
	//return &spiBuffer[12];
}

static inline volatile void spiDataRead_key2(uint32_t address) {
	// specialized for key2 (search for preinit_key2)
	// write address
	*(volatile uint32_t *)&spiBuffer[0] = __builtin_bswap32(address);

	// enable tx dma channel
	DMA2_Channel1->CCR |= DMA_CCR_EN | DMA_CCR_CIRC;
}

static inline void handle_command() {
	// when using preinit in chip select, we have already read 6 command bytes
	WAIT_FOR_BYTE(0);

	switch (command[0]) {
	case 0x00: {
		preinit_command();
		WAIT_FOR_BYTE(4);
		uint32_t address = (__builtin_bswap32(COMMAND_HI) << 8) | command[4];
		spiDataRead_command(address);

		SPI_WAIT(0x1000, 0);
		DATA_OUT = transferBuffer[0];
		SPI_WAIT(0x1000, 0xFFF); // wait till we receive it all because we're getting aborted
		break;
	}

	case 0x90: {
		DATA_OUT = transferBuffer[0] = config.chip_id[0];
		transferBuffer[1] = config.chip_id[1];
		transferBuffer[2] = config.chip_id[2];
		transferBuffer[3] = config.chip_id[3];

		for (int i = 4; i < 0x200; i += 4) {
			*(volatile uint32_t *)&transferBuffer[i] = *(uint32_t *)config.chip_id;
		}
		break;
	}

	case 0x9F: {
		// dummy command
		// (nb: we are not fast enough to fill keybuf here)
		break;
	}

	case 0x3C: {
		// enable KEY1
		currentState = 3;
		keybuf_ptr = (uint32_t *)keybuf_nds;
		break;
	}

	case 0x3D: {
		// enable KEY1 (dsi)
		currentState = 3;
		keybuf_ptr = (uint32_t *)keybuf_dsi;
		break;
	}

	case 'F': {
		WAIT_FOR_BYTE(4);
		if (command[1] == 'L' && command[2] == 'A' && command[3] == 'S' && command[4] == 'H') {
			// switch to flash mode
			currentState = 7;
			break;
		}

		// falls to default
	}

	default: {
		break;
	}
	}
}

static inline void handle_key1() {
	WAIT_FOR_BYTE(7); // we want the whole command
	key1_decrypt_cmd((volatile uint32_t *)command);

	// command_hi and command_lo are byte-reversed
	// encrypted input = {01, 02, 03, 04, 05, 06, 07, 08}
	// decrypted command = {04, 03, 02, 01, 08, 07, 06, 05}
	// command_hi = 0x01020304
	// command_lo = 0x05060708

	switch (command[3] >> 4) {
		case 0x1: {
			CALCULATE_KEY2_WHILE(DATA_PROGRESS() < (0x910 - 0x40));

			// 1lllliiijjjkkkkkh (914h) - 2nd Get ROM Chip ID / Get KEY2 Stream
			uint16_t pos = 0x910;
			KEY2_BEGIN();
			*(volatile uint32_t *)&transferBuffer[0x900] = __builtin_bswap32(seedAvailable);
			*(volatile uint32_t *)&transferBuffer[0x904] = __builtin_bswap32(seedPosition);

			while (pos < (0x910+0x200)) {
				*(volatile uint32_t *)&transferBuffer[pos] = *(uint32_t *)config.chip_id ^ KEY2_AT_32(pos);
				pos += 4;
			}

			KEY2_END();
			break;
		}

		case 0x2: {
			// 2bbbbiiijjjkkkkkh (19B8h) - Get Secure Area Block (4KBytes)
			uint32_t address = ((COMMAND_HI >> 12) & 0xFFFF) * 0x1000;

			preinit_key1();
			spiDataRead_key1(address);

			CALCULATE_KEY2_WHILE(DATA_PROGRESS() < (0x910 - 0x40));

			KEY2_BEGIN();

			uint16_t pos = 0;
			uint16_t key2pos = 0x910;

			for (int j = 0; j < 8; j++) {
				// 0x200 + 0x18 dummy

				// Write 0x200 bytes!
				for (int i = 0; i < 0x200/0x80; i++) {
					DUMMY_KEY2_WHILE(!IS_SPI_AVAILABLE(0x1000, pos+0x7F));
					for (int k = 0; k < 0x80; k += 4) {
						*(volatile uint32_t *)&transferBuffer[key2pos+k] = *(volatile uint32_t *)&transferBuffer[0x19B8-0x1000+pos+k] ^ KEY2_AT_32(key2pos+k);
					}

					pos += 0x80;
					key2pos += 0x80;
				}

				key2pos += 0x18;

				// we wrote up to `key2pos`
				// continue when the console has caught up with us
				CALCULATE_KEY2_WHILE(DATA_PROGRESS() < (key2pos - 0x40));
			}

			KEY2_END();
			break;
		}

		case 0x4: {
			// 4llllmmmnnnkkkkkh (910h) - Activate KEY2 Encryption Mode
			// ^^^^^^^^--------
			uint32_t seed = ((COMMAND_HI << 12) | (COMMAND_LO >> 20)) & 0xFFFFFF;
			currentState = 5;
			initialize_key2(seed);
			break;
		}

		case 0xA: {
			// Alllliiijjjkkkkkh (910h) - Enter Main Data Mode
			// we don't care about transfer buffer or anything
			// state key2
			currentState = 4;
			break;
		}

		default: {
			break;
		}
	}
}

static inline void handle_key2() {
	KEY2_BEGIN();

	WAIT_FOR_BYTE(0);
	int cmd = command[0] ^ KEY2_AT(0);

	switch (cmd) {
	case 0xB7: {
		preinit_key2();
		WAIT_FOR_BYTE(3);
		uint32_t address = (__builtin_bswap32(COMMAND_HI ^ KEY2_AT_32(0)) << 8);// | (command[4] ^ KEY2_AT(4));
		address &= 0x7fffff;
		if (address < 0x8000) {
			address = 0x8000 + (address & 0x1FF);
		}

		spiDataRead_key2(address);
#ifdef TRANSFER_1000H
		SPI_WAIT(0x1000, 0);
#else
		SPI_WAIT(0x200, 0);
#endif
		DATA_OUT = (transferBuffer[0] ^= KEY2_AT(8));

		uint16_t pos = 1;
		int16_t savail = seedAvailable;

		// overall: 18 clocks per byte (not incl. the loop)
		// mathematically: uC is 150 mhz, spi is 75mhz, 9.3mhz for byte transfer,
		// which means we need 16 clocks for a single byte

		// thus we need 64 clocks for 4 bytes, but we are fine with 72.
		// (we need 128 clocks for 8 bytes)
		// first run is 156 clocks, the second run is 83 clocks (which is a bit better).

		// we need to optimize this way because compiler hates us

		// Update: (I wrote the comments above 6 months ago)
		// This snippet works for some reason ; it is synchronizing with the SPI
		// and it has been tested at various transfer rates.
		// It's not the best way to synchronize (it's dependant on the clock rate)
		// The TRANSFER_1000h variant doesn't depend on the CPU clock rate;
		// but the 200h first bytes are the hardest (because we need to provide
		// an immediate response)

