NathaanTFM/stm32cart/Core/Src/ndscart.c
		if (savail < 0x3CE0) {
			// do the first bytes "byte per byte"
			for (; pos < 0x20; pos++) {
				transferBuffer[pos] ^= KEY2_AT(8+pos);
				__NOP(); __NOP(); __NOP();
			}

			for (; pos < 0x200; pos += 4) {
				savail = key2_step_4(savail, _spos);
				__NOP(); __NOP(); __NOP(); // timings....
				__NOP(); __NOP(); __NOP();
				__NOP(); __NOP(); __NOP();
				*(volatile uint32_t *)&transferBuffer[pos] ^= KEY2_AT_32(8+pos);
			}

		} else {
			// only write byte per byte
			for (; pos < 0x200; pos++) {
				transferBuffer[pos] ^= KEY2_AT(8+pos);
				__NOP(); __NOP(); __NOP();
			}
		}

#ifdef TRANSFER_1000H
		do {
			CALCULATE_KEY2_WHILE(DATA_PROGRESS() < (pos - 0x20));

			uint16_t avail = SPI_AVAILABLE(0x1000) & ~3;
			if (avail - pos > 0x100) avail = pos + 0x100;
			for (; pos < avail; pos += 4) {
				*(volatile uint32_t *)&transferBuffer[pos] ^= KEY2_AT_32(8+pos);
			}
		} while (pos != 0x1000);
#endif

		break;

	}
	case 0xB8: {
		DATA_OUT = transferBuffer[0] = config.chip_id[0] ^ KEY2_AT(8);
		transferBuffer[1] = config.chip_id[1] ^ KEY2_AT(9);
		transferBuffer[2] = config.chip_id[2] ^ KEY2_AT(10);
		transferBuffer[3] = config.chip_id[3] ^ KEY2_AT(11);

		// Writing more means it gets interrupted by chip unselect and then chip select,
		// which gives us less time to handle the next command.
		break;
	}

	default: {
		break;
	}
	}

	KEY2_END();
}


/** Disables input DMA channels */
static void disable_dma_input() {
	// Disable every DMA channel
	DMA1_Channel1->CCR &= ~DMA_CCR_EN; // Disable DMA for transfer input
	DMA1_Channel2->CCR &= ~DMA_CCR_EN; // Disable DMA for transfer output
	DMA1_Channel3->CCR &= ~DMA_CCR_EN; // Disable DMA for gpio mode
	DMA1_Channel4->CCR &= ~DMA_CCR_EN; // Disable DMA for CS1 low
	DMA1_Channel5->CCR &= ~DMA_CCR_EN; // Disable DMA for CS1 high (or CS2 low)
}

static void enable_dma_input() {
	// Re-enable DMA channels
	DMA1_Channel1->CCR |= DMA_CCR_EN; // Enable DMA for transfer input
	DMA1_Channel2->CCR |= DMA_CCR_EN; // Enable DMA for transfer output
	DMA1_Channel3->CCR |= DMA_CCR_EN; // Enable DMA for gpio mode
	DMA1_Channel4->CCR |= DMA_CCR_EN; // Enable DMA for CS1 low
	DMA1_Channel5->CCR |= DMA_CCR_EN; // Enable DMA for CS1 high (or CS2 low)
	//__enable_irq();
}

static void flash_keybuf(const uint32_t *keybuf, uint8_t *data, int special) {
	uint32_t address = (uint32_t)keybuf;

	FLASH_EraseInitTypeDef erase;
	erase.TypeErase = FLASH_TYPEERASE_PAGES;
	erase.Banks = FLASH_BANK_1; // i have a single bank
	erase.Page = (address - FLASH_BASE) / FLASH_PAGE_SIZE; // erase our page
	erase.NbPages = KEYBUF_SIZE / FLASH_PAGE_SIZE; // (erase 8 KB)
	uint32_t pageerror;

	HAL_FLASH_Unlock();
	HAL_FLASHEx_Erase(&erase, &pageerror);

	int j = 0;
	for (int i = 0; i < 0x1048; i += 8) {
		if (special && j != 0 && (j & 0x1FF) == 0) {
			j += 8;
		}
		HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, address + i, *(uint64_t *)&data[j]);
		j += 8;
		// TODO: proper error handling
	}

	HAL_FLASH_Lock();
}

static void flash_config(uint32_t offset, uint8_t *data, int special) {
	uint32_t addr = (uint32_t)&config + 0x1000 * offset;

	if (addr >= (uint32_t)&config && addr < ((uint32_t)&config + sizeof(config))) {
		FLASH_EraseInitTypeDef erase;
		erase.TypeErase = FLASH_TYPEERASE_PAGES;
		erase.Banks = FLASH_BANK_1; // i have a single bank
		erase.Page = (addr - FLASH_BASE) / FLASH_PAGE_SIZE; // erase our page
		erase.NbPages = CONFIG_SIZE / FLASH_PAGE_SIZE; // (erases 4 KB)
		uint32_t pageerror;

		HAL_FLASH_Unlock();
		HAL_FLASHEx_Erase(&erase, &pageerror);

		int j = 0;
		for (int i = 0; i < 0x1000; i += 8) {
			if (special && j != 0 && (j & 0x1FF) == 0) {
				j += 8;
			}
			HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, addr + i, *(uint64_t *)&data[j]);
			j += 8;
			// TODO: proper error handling
		}

		HAL_FLASH_Lock();
	}
}

static void preinit_flash(int32_t transferred) {
	gpioModeBuffer[7] = 0x5555;

	// N.B: there's a tiny amount of time between chip unselect and this function
	// where transfers are allowed (and shouldn't be).
	// The timing is very tight so it shouldn't cause any issue, but leaving that here
	// so I might fix that later

	if (transferred >= 8) {
		// We have a upcoming flash operation going on, maybe
		// Right now we have our IRQ disabled; but we wanna make sure our transferBuffer doesn't get destroyed
		disable_dma_input();

		switch (command[0]) {
		case 'E': {
			// Sector [E]rase
			uint32_t address = (__builtin_bswap32(COMMAND_HI) << 8) | (command[4]);
			spiEraseSector(address);
			break;
		}

		case 'P': {
			// Page [P]rogram
			if (transferred >= 0x208) {
				uint32_t address = (__builtin_bswap32(COMMAND_HI) << 8);
				uint32_t chksum = __builtin_bswap32(COMMAND_LO); // TODO: use it

				spiProgramPage(address, command+8);
				spiProgramPage(address+0x100, command+0x108);

				if (address == 0) {
					// re-calculate flashbuf
					keybuf_ptr = (uint32_t *)seedBuffer;

					// command+8 is ROM header
					// gamecode is @ 0xC
					key1_init(*(uint32_t *)(command+8+0xC), blowfish_nds);
					flash_keybuf(keybuf_nds, (uint8_t *)keybuf_ptr, 0);

					key1_init(*(uint32_t *)(command+8+0xC), blowfish_dsi);
					flash_keybuf(keybuf_dsi, (uint8_t *)keybuf_ptr, 0);
				}
			}
			break;
		}

		case 'R': {
			// Chip erase ([R]eset)
			spiEraseChip();
			break;
		}

		case 'C': {
			// Update [C]onfig
			uint32_t offset = (__builtin_bswap32(COMMAND_HI) << 8);

			if (transferred >= 0x1008+0x40) {
				flash_config(offset, (uint8_t *)(command+8), 1);
			}
			break;
		}

		case 'B': {
			// Update [B]lowfish table

			if (transferred >= (4*0x412)+8+0x40) {
				// That's very long. NDS supports it, apparently (2000h bytes transfers)
				flash_keybuf(keybuf_nds, (uint8_t *)(command+8), 1);
			}

			break;
		}

		case 'T': {
			// Update Blowfish table for [T]WL

			if (transferred >= (4*0x412)+8+0x40) {
				// That's very long. NDS supports it, apparently (2000h bytes transfers)
				flash_keybuf(keybuf_dsi, (uint8_t *)(command+8), 1);
			}

			break;
		}

