NathaanTFM/stm32cart/Core/Src/ndscart.c
		}

		enable_dma_input();
	}
}

// This whole flashing protocol is a mess
static void handle_flash() {
	WAIT_FOR_BYTE(0)

	switch (command[0]) {
	case 'I': { // Chip ID query (checks if cart is ready)
		DATA_OUT = transferBuffer[0] = config.chip_id[0];
		transferBuffer[1] = config.chip_id[1];
		transferBuffer[2] = config.chip_id[2];
		transferBuffer[3] = config.chip_id[3];
		break;
	}

	case 'J': { // Alternate version (no chip id)
		DATA_OUT = transferBuffer[0] = 'R';
		transferBuffer[1] = 'D';
		transferBuffer[2] = 'Y';
		transferBuffer[3] = '!';
		break;
	}

	case 'P':
	case 'C':
	case 'B':
	case 'T': {
		// Implemented in preinit_flash
		// Stay in input mode for these commands
		// (Alternative would be to disable the DMA transfer? TODO)
		*(volatile uint16_t *)&GPIOA->MODER = gpioModeBuffer[7] = 0;
		break;
	}

	case 'R':
	case 'E': {
		// Reset and erase are in preinit_flash
		break;
	}
	}
}


void irqhandler() {
	longjmp(jmp, 0);
}

// we don't really care about our registers when we enter irqhandler, so here's another way
void EXTI15_10_IRQHandler() {
	// stack contains r0, r1, r2, r3, r12, lr, pc, xPSR
	__asm__ (
		// __disable_irq
		"cpsid i\n"

		// EXTI->PR1 = (CS1_Pin | CS2_Pin)
		"mov.w r3, #0x0400\n" // address 0x40010400
		"movt r3, #0x4001\n"
		"mov.w r2, #0xC000\n" // (CS1_Pin | CS2_Pin)
		"str r2, [r3,#0x14]\n"

		//"pop {r1,r2,r3,r4,r5,r6,r7}\n"

		// Update PC
		"ldr r1, =irqhandler\n"
		"str r1, [sp,#24]\n"

		// Update xPSR
		"ldr r1, [sp,#28]\n"
		"bic r1, r1, #0xFE00FE00\n"
		"bic r1, r1, #0xFF0000\n"
		"str r1, [sp,#28]\n"

		//"push {r1,r2,r3,r4,r5,r6,r7}\n"
		"bx lr\n"
	);
}

static void consumeKey2(int32_t count) {
	if (count <= 0)
		return;

	seedPosition = (seedPosition + count) & SEED_MASK;
	seedAvailable -= count;
}

static void on_chip_select() {
	// chip selected
	cs1Enabled = 1;
	__enable_irq();

	switch (currentState) {
	case 0:
		handle_command();
		break;

	case 1:
		handle_key1();
		break;

	case 2:
		handle_key2();
		break;

	case 6:
		handle_flash();
		break;
	}
}

#ifdef ENABLE_SPI2
#define DATA_SPI2 (*(volatile uint8_t *)&SPI2->DR)
#define WAIT_RX_SPI2() do ; while ((SPI2->SR & SPI_SR_RXNE) == 0)
#define WAIT_TX_SPI2() do ; while ((SPI2->SR & SPI_SR_FTLVL) == SPI_SR_FTLVL)

static void on_spi_select() {
	cs2Enabled = 1;
	__enable_irq();

	// Can DMA be used here? It would most likely be very helpful
	// We've had some issues with DMA though

	// Enable DMA channels
	//DMA2_Channel3->CCR |= DMA_CCR_EN;
	//DMA2_Channel4->CCR |= DMA_CCR_EN;

	// wait for RX
	WAIT_RX_SPI2();
	uint8_t byte = DATA_SPI2;

	switch (byte) {
	case 0x05: // read status register
		DATA_SPI2 = 0;//(spi2_write_status == 0 ? 0 : 1) | (spi2_sector_progress << 1);
		break;

	case 0x01:
		WAIT_RX_SPI2();
		uint8_t sr = DATA_SPI2;
		UNUSED(sr);
		break;

	case 0x06:
		break;

	case 0x04:
		break;

	case 0x03: {
		//if (spi2_write_status != 0)
		//	break;

		uint32_t address = 0;
		WAIT_RX_SPI2();
		address |= DATA_SPI2 << 8;
		WAIT_RX_SPI2();
		address |= DATA_SPI2;

		//volatile uint8_t *buf = spiDataRead(address, 0x200, spi2_sector_backup);
		const uint8_t *buf = &config.spi_data[address];

		int n = 0;
		for (;;) {
			//SPI_WAIT(0x200, n);
			WAIT_TX_SPI2();
			DATA_SPI2 = buf[n];
			n++;
		}

		break;
	}

	case 0x02: {
		WAIT_RX_SPI2();
		uint16_t address = DATA_SPI2 << 8;
		WAIT_RX_SPI2();
		address |= DATA_SPI2;

		/*
		__enable_irq();
		spi2_write_status = 1;
		spi2_write_address = 0xFF0000 | address;
		spi2_write_progress = 0;
		spi2_write_length = 0;
		spi2_sector_progress = 0;
		__disable_irq();
		*/

		for (;;) {
			WAIT_RX_SPI2();
			__disable_irq();
			//spi2_write_input[spi2_write_length++] = DATA_SPI2;
			//fake_save[address] = DATA_SPI2;
			__enable_irq();
			address++;
		}

		break;
	}

	default:
		for (;;) {
			WAIT_TX_SPI2();
			*(volatile uint8_t *)&SPI2->DR = 0xFF;
		}
	}

	// SPI2_MISO enable
	//GPIOB->MODER = (GPIOB->MODER & ~(3<<(14*2))) | (2<<(14*2));

	// Make sure the other pins won't cause any trouble (input mode)

	// Enable DMA channels and SPI

}

static inline uint8_t spi1_transfer(uint8_t value) {
	while (!(SPI1->SR & SPI_SR_TXE));
	DATA_SPI1 = value;

	while (!(SPI1->SR & SPI_SR_RXNE)); // wait to read the next coming byte
	return DATA_SPI1;
}

static inline uint8_t spi1_send_recv(uint8_t byte) {
	spiSelect();
	spi1_transfer(byte);
	uint8_t b = spi1_transfer(0);
	spiUnselect();
	return b;
}

static inline void spi1_send(uint8_t byte) {
	spiSelect();
	spi1_transfer(byte);
	spiUnselect();
	return;
}
#endif

static void on_chip_unselect() {
	// chip unselected
	// switch to read gpioa
	*(volatile uint16_t*)&GPIOA->MODER = 0;

	// restart dma
	int32_t transferred = DATA_PROGRESS();
	dmaRestart();

#ifdef ENABLE_SPI2
	if (cs2Enabled) {
		cs2Enabled = 0;
		spi2Reset();
	}
#endif

	if (cs1Enabled) {
		cs1Enabled = 0;
		//spiAbort();

		// state transition
		switch (currentState) {
		case 0:
			// normal command
			//preinit_command();
			break;

		case 1:
			// key1 command, advance by transferred
			consumeKey2(transferred);
			//preinit_key1();
			break;

		case 2:
			// key2 command, advance by transferred + command size
			consumeKey2(transferred+8);
			//preinit_key2();
			break;

		case 3:
			// switch from normal to key1
			currentState = 1;
			//preinit_key1();
			break;

		case 4:
			// switch from key1 to key2
			consumeKey2(transferred);
			currentState = 2;
			//preinit_key2();
			break;

		case 5:
			// re-set key2 seeds (key1-only command)
			currentState = 1;
			//preinit_key1();

			//consumeKey2(transferred-0x910);
			break;

		case 6:
			// flash mode, ignore
			preinit_flash(transferred+8);
			break;

		case 7:
			// switch to flash mode
			currentState = 6;
			preinit_flash(-1);
			break;
		}

	}

	__enable_irq();
}

#define MODER_INPUT(n) (0<<(2*n))
#define MODER_OUTPUT(n) (1<<(2*n))
#define MODER_ALTERNATE(n) (2<<(2*n))
#define MODER_ANALOG(n) (3<<(2*n))

#define PUPDR_NOPULL(n) (0<<(2*n))
#define PUPDR_PULLUP(n) (1<<(2*n))
#define PUPDR_PULLDOWN(n) (2<<(2*n))

#define OSPEEDR_LOW(n) (0<<(2*n))
#define OSPEEDR_MEDIUM(n) (1<<(2*n))
#define OSPEEDR_HIGH(n) (2<<(2*n))
#define OSPEEDR_VERYHIGH(n) (3<<(2*n))

