NathaanTFM/stm32cart/Core/Src/ndscart.c
#define AFR0_SEL(n, v) ((v)<<(4*n))
#define AFR1_SEL(n, v) ((v)<<(4*(n-8)))

void ndscart_begin() {
	// disable systick, we don't need it
	SysTick->CTRL = 0;

	// enable peripherals
	LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_SPI2);
    LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_SYSCFG|LL_APB2_GRP1_PERIPH_SPI1);
    LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_DMA1|LL_AHB1_GRP1_PERIPH_DMA2|LL_AHB1_GRP1_PERIPH_DMAMUX1);
    LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_GPIOA|LL_AHB2_GRP1_PERIPH_GPIOB|LL_AHB2_GRP1_PERIPH_GPIOF);

#ifdef ENABLE_SPI2
	// Configure GPIOF:
	// (1) SPI2_SCK		AF5 (?)

	GPIOF->AFR[0] = (
			AFR0_SEL(1, 5)
	);

	GPIOF->MODER = (
			MODER_ANALOG(0) | MODER_ALTERNATE(1)
	);

	GPIOF->PUPDR = (
			PUPDR_NOPULL(0) | PUPDR_NOPULL(1)
	);

	GPIOF->OSPEEDR = (
			OSPEEDR_LOW(0) | OSPEEDR_HIGH(1)
	);
#endif

	// Configure GPIOB:
	// (3) SPI1_SCK     AF5
	// (4) SPI1_MISO    AF5
	// (5) SPI1_MOSI    AF5
	// (6) SPI1_CS      GPIO output
	// (14) SPI2_MISO	AF5 (analog)

	GPIOB->AFR[0] = (
			AFR0_SEL(3, 5) | AFR0_SEL(4, 5) | AFR0_SEL(5, 5)
	);

	GPIOB->AFR[1] = (
			AFR1_SEL(14, 5)
	);

	GPIOB->MODER = (
			MODER_ANALOG(0) | MODER_ANALOG(1) | MODER_ANALOG(2) | MODER_ALTERNATE(3)
			| MODER_ALTERNATE(4) | MODER_ALTERNATE(5) | MODER_OUTPUT(6) | MODER_ANALOG(7)
			| MODER_ANALOG(8) | MODER_ANALOG(9) | MODER_ANALOG(10) | MODER_ANALOG(11)
			| MODER_ANALOG(12) | MODER_ANALOG(13) | MODER_ALTERNATE(14) | MODER_ANALOG(15)
	);

	GPIOB->PUPDR = (
			PUPDR_NOPULL(0) | PUPDR_NOPULL(1) | PUPDR_NOPULL(2) | PUPDR_NOPULL(3)
			| PUPDR_NOPULL(4) | PUPDR_NOPULL(5) | PUPDR_NOPULL(6) | PUPDR_NOPULL(7)
			| PUPDR_NOPULL(8) | PUPDR_NOPULL(9) | PUPDR_NOPULL(10) | PUPDR_NOPULL(11)
			| PUPDR_NOPULL(12) | PUPDR_NOPULL(13) | PUPDR_NOPULL(14) | PUPDR_NOPULL(15)
	);

	GPIOB->OSPEEDR = (
			OSPEEDR_LOW(0) | OSPEEDR_LOW(1) | OSPEEDR_LOW(2) | OSPEEDR_HIGH(3)
			| OSPEEDR_HIGH(4) | OSPEEDR_HIGH(5) | OSPEEDR_LOW(6) | OSPEEDR_LOW(7)
			| OSPEEDR_LOW(8) | OSPEEDR_LOW(9) | OSPEEDR_LOW(10) | OSPEEDR_LOW(11)
			| OSPEEDR_LOW(12) | OSPEEDR_LOW(13) | OSPEEDR_HIGH(14) | OSPEEDR_LOW(15)
	);


	// Configure GPIOA:
	// CS1 (14), CS2 (15): exti with rising/falling, high speed
	// CLK (12): exti (event) with rising/falling, high speed
	// I/O (0-7): input with high speed
	// SPI2_MOSI (11): AF5
	// for the rest, analog mode (3)

	GPIOA->AFR[1] = (
			AFR1_SEL(11, 5)
	);

	GPIOA->MODER = (
			MODER_INPUT(0) | MODER_INPUT(1) | MODER_INPUT(2) | MODER_INPUT(3)
			| MODER_INPUT(4) | MODER_INPUT(5) | MODER_INPUT(6) | MODER_INPUT(7)
			| MODER_ANALOG(8) | MODER_ANALOG(9) | MODER_ANALOG(10) | MODER_ALTERNATE(11)
			| MODER_INPUT(12) | MODER_ANALOG(13) | MODER_INPUT(14) | MODER_INPUT(15)
	);

	GPIOA->PUPDR = (
			PUPDR_NOPULL(0) | PUPDR_NOPULL(1) | PUPDR_NOPULL(2) | PUPDR_NOPULL(3)
			| PUPDR_NOPULL(4) | PUPDR_NOPULL(5) | PUPDR_NOPULL(6) | PUPDR_NOPULL(7)
			| PUPDR_NOPULL(8) | PUPDR_NOPULL(9) | PUPDR_NOPULL(10) | PUPDR_NOPULL(11)
			| PUPDR_PULLUP(12) | PUPDR_NOPULL(13) | PUPDR_PULLUP(14) | PUPDR_PULLUP(15)
	);

	GPIOA->OSPEEDR = (
			OSPEEDR_HIGH(0) | OSPEEDR_HIGH(1) | OSPEEDR_HIGH(2) | OSPEEDR_HIGH(3)
			| OSPEEDR_HIGH(4) | OSPEEDR_HIGH(5) | OSPEEDR_HIGH(6) | OSPEEDR_HIGH(7)
			| OSPEEDR_LOW(8) | OSPEEDR_LOW(9) | OSPEEDR_LOW(10) | OSPEEDR_HIGH(11)
			| OSPEEDR_HIGH(12) | OSPEEDR_LOW(13) | OSPEEDR_HIGH(14) | OSPEEDR_HIGH(15)
	);

	SYSCFG->EXTICR[3] = 0; // Port A for all EXTI12-15
	EXTI->RTSR1 = (1<<12) | (1<<14);// | (1<<15); // enable rising trigger for EXTI12, EXTI14 and EXTI15
	EXTI->FTSR1 = (1<<12) | (1<<14);// | (1<<15); // enable falling trigger for EXTI12, EXTI14 and EXTI15
	EXTI->EMR1 = (1<<12); // event generation for EXTI12
	EXTI->IMR1 = (1<<14);// | (1<<15); // enable interrupt generation for EXTI14 and EXTI15, disable for EXTI12

#ifdef ENABLE_SPI2
	if (config.spi_variant != 0) {
		EXTI->RTSR1 |= (1<<15);
		EXTI->FTSR1 |= (1<<15);
		EXTI->IMR1 |= (1<<15);
	}
#endif

	initKey2Default();

	// Initialize gpioModeBuffer
	for (int i = 0; i < sizeof(gpioModeBuffer) / 2; i++) {
		if (i < 7) { // 0 to 6
			gpioModeBuffer[i] = 0;
		} else { // 7
			gpioModeBuffer[i] = 0x5555;
		}
	}

	*(volatile uint16_t*)&GPIOA->MODER = 0;

#ifdef ENABLE_SPI2
	// SPI2 init
	if (config.spi_variant != 0) {
		spi2Init();
	}
#endif

	// Initialize DMA
	dmaInit();
	dmamuxInit();
	spiInit();
	spiInitDma();
	spiUnselect();

	// Initialize transfers
	__disable_irq();
	NVIC_EnableIRQ(EXTI15_10_IRQn);
	dmaRestart();
	spiStop();

	spiPrepareEnable();
	DMA1_Channel4->CCR |= DMA_CCR_EN; // CS1 low transfer
	DMA1_Channel5->CCR |= DMA_CCR_EN; // CS2 low/CS1 high transfer
	setjmp(jmp);

	// read GPIO, check CS status
	uint16_t idr = *(volatile uint16_t *)&GPIOA->IDR;

	if ((idr & CS1_Pin) == 0) {
		on_chip_select();
		spiAbort();

#ifdef ENABLE_SPI2
	} else if ((idr & CS2_Pin) == 0) {
		if (config.spi_variant != 0) {
			on_spi_select();
		}
		spiAbort();
#endif

	} else {
		spiAbort();
		on_chip_unselect();
	}

	// done ; loop now
	key2_loop();
	for (;;) {
		HAL_PWR_EnterSLEEPMode(PWR_LOWPOWERREGULATOR_ON, PWR_SLEEPENTRY_WFI);
	}
}

